brew "git"
brew "bat"
brew "deno"
brew "tree"
brew "zsh-syntax-highlighting"
brew "jump"
brew "bat"
brew "tree"
brew "zsh-autosuggestions"
brew "git-gui"
brew "tokei"
brew "maccy"

cask "kitty"
cask "rectangle"
cask "visual-studio-code"
