# Version Control
brew "git"
brew "git-gui"

# CLI Utilities
brew "bat"
brew "tree"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "jump"
brew "tokei"

# Programming Languages
brew "node"
brew "python@3.11"
brew "java@21"
brew "deno"


# Development Tools
brew "docker"
brew "curl"

# Terminal & Shell
cask "kitty"

cask "rectangle"

# Editors & IDEs
cask "visual-studio-code"
cask "insomnia"

