# Version Control
brew "git"

# Programming Languages & Runtimes
brew "node"
brew "python@3.12"
brew "openjdk@21"
brew "go"

# Development Tools
brew "docker"

# CLI Utilities
brew "bat"
brew "tree"
brew "curl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Applications
cask "visual-studio-code"
cask "insomnia"
cask "rectangle"
cask "kitty"
cask "maccy"
